# DataFrame 정제
: NaN으로 빠진 값이나 정상적이지 않은 값(결측치(missing value),이상치)의 정제

In [1]:
import numpy as np
import pandas as pd

In [2]:
# numpy의 난수를 이용하여 DataFrame 만들기

df = pd.DataFrame(np.random.rand(6,4)) # 0과 1사이의 값을 6행 4열의 데이터프레임으로 생성
df

          0         1         2         3
0  0.712979  0.623828  0.601711  0.235835
1  0.837129  0.354099  0.446064  0.276301
2  0.077149  0.206456  0.303507  0.481868
3  0.630283  0.541278  0.584108  0.217360
4  0.474214  0.521541  0.425261  0.425124
5  0.027425  0.790903  0.751585  0.959855

In [4]:
# Column과 index이름 넣기

df.columns = ["A","B","C","D"]
df.index = pd.date_range("20220701",periods=6) # pd.data_range(start-date, 기간:6일치)
df

                   A         B         C         D
2022-07-01  0.712979  0.623828  0.601711  0.235835
2022-07-02  0.837129  0.354099  0.446064  0.276301
2022-07-03  0.077149  0.206456  0.303507  0.481868
2022-07-04  0.630283  0.541278  0.584108  0.217360
2022-07-05  0.474214  0.521541  0.425261  0.425124
2022-07-06  0.027425  0.790903  0.751585  0.959855

In [5]:
# index type 확인
df.index

DatetimeIndex(['2022-07-01', '2022-07-02', '2022-07-03', '2022-07-04',
               '2022-07-05', '2022-07-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
# 새로운 F열 생성과 값 입력

df["F"] = [1.0,np.nan,3.5,6.1,np.nan,7.0]
df

                   A         B         C         D    F
2022-07-01  0.712979  0.623828  0.601711  0.235835  1.0
2022-07-02  0.837129  0.354099  0.446064  0.276301  NaN
2022-07-03  0.077149  0.206456  0.303507  0.481868  3.5
2022-07-04  0.630283  0.541278  0.584108  0.217360  6.1
2022-07-05  0.474214  0.521541  0.425261  0.425124  NaN
2022-07-06  0.027425  0.790903  0.751585  0.959855  7.0

In [10]:
# NaN이 하나라도 있는 Data행 삭제
df.dropna(how='any') # how = 'any' (default)

                   A         B         C         D    F
2022-07-01  0.712979  0.623828  0.601711  0.235835  1.0
2022-07-03  0.077149  0.206456  0.303507  0.481868  3.5
2022-07-04  0.630283  0.541278  0.584108  0.217360  6.1
2022-07-06  0.027425  0.790903  0.751585  0.959855  7.0

In [11]:
# NaN이 모든 열에 data로 있는 경우의 행 삭제 
df.dropna(how='all') # 모든 data가 NaN인 경우가 없으니 기존 데이터 그대로임

                   A         B         C         D    F
2022-07-01  0.712979  0.623828  0.601711  0.235835  1.0
2022-07-02  0.837129  0.354099  0.446064  0.276301  NaN
2022-07-03  0.077149  0.206456  0.303507  0.481868  3.5
2022-07-04  0.630283  0.541278  0.584108  0.217360  6.1
2022-07-05  0.474214  0.521541  0.425261  0.425124  NaN
2022-07-06  0.027425  0.790903  0.751585  0.959855  7.0

In [12]:
# NaN값을 특정 값으로 변경
df.fillna(value=5.0)

                   A         B         C         D    F
2022-07-01  0.712979  0.623828  0.601711  0.235835  1.0
2022-07-02  0.837129  0.354099  0.446064  0.276301  5.0
2022-07-03  0.077149  0.206456  0.303507  0.481868  3.5
2022-07-04  0.630283  0.541278  0.584108  0.217360  6.1
2022-07-05  0.474214  0.521541  0.425261  0.425124  5.0
2022-07-06  0.027425  0.790903  0.751585  0.959855  7.0

In [13]:
# Boolean Index를 통해 검색 및 변경
df.isnull()

                A      B      C      D      F
2022-07-01  False  False  False  False  False
2022-07-02  False  False  False  False   True
2022-07-03  False  False  False  False  False
2022-07-04  False  False  False  False  False
2022-07-05  False  False  False  False   True
2022-07-06  False  False  False  False  False

In [14]:
# F열에서 NaN을 포함하고 있는 행 찾기
df.loc[df.F.isnull(),:] # (= df.loc[df.isnull()["F"],:] )

                   A         B         C         D   F
2022-07-02  0.837129  0.354099  0.446064  0.276301 NaN
2022-07-05  0.474214  0.521541  0.425261  0.425124 NaN

In [16]:
# index를 이용하여 행 제거 
df.drop(pd.to_datetime("20220701")) # (= df.drop("2022-07-01"))

                   A         B         C         D    F
2022-07-02  0.837129  0.354099  0.446064  0.276301  NaN
2022-07-03  0.077149  0.206456  0.303507  0.481868  3.5
2022-07-04  0.630283  0.541278  0.584108  0.217360  6.1
2022-07-05  0.474214  0.521541  0.425261  0.425124  NaN
2022-07-06  0.027425  0.790903  0.751585  0.959855  7.0

In [17]:
df.drop([pd.to_datetime("20220701"),pd.to_datetime("20220702")])

# type error
# df.drop(["2022-07-01",pd.to_datetime("20220702")])

                   A         B         C         D    F
2022-07-03  0.077149  0.206456  0.303507  0.481868  3.5
2022-07-04  0.630283  0.541278  0.584108  0.217360  6.1
2022-07-05  0.474214  0.521541  0.425261  0.425124  NaN
2022-07-06  0.027425  0.790903  0.751585  0.959855  7.0

In [20]:
# 열 삭제
# del df["F"] # 바로 삭제됨 
df.drop(["B","F"],axis="columns") # inplace적용 전 삭제 안됨
# (= df.drop(["B","F"],axis=1))

                   A         C         D
2022-07-01  0.712979  0.601711  0.235835
2022-07-02  0.837129  0.446064  0.276301
2022-07-03  0.077149  0.303507  0.481868
2022-07-04  0.630283  0.584108  0.217360
2022-07-05  0.474214  0.425261  0.425124
2022-07-06  0.027425  0.751585  0.959855

In [21]:
df

                   A         B         C         D    F
2022-07-01  0.712979  0.623828  0.601711  0.235835  1.0
2022-07-02  0.837129  0.354099  0.446064  0.276301  NaN
2022-07-03  0.077149  0.206456  0.303507  0.481868  3.5
2022-07-04  0.630283  0.541278  0.584108  0.217360  6.1
2022-07-05  0.474214  0.521541  0.425261  0.425124  NaN
2022-07-06  0.027425  0.790903  0.751585  0.959855  7.0

In [65]:
data = [
    [1.4,np.nan],
    [7.1,-4.5],
    [np.nan,np.nan],
    [0.75,-1.3]
]

df = pd.DataFrame(data,columns=['one','two'],index=['a','b','c','d'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [66]:
# 열방향 합계 구하기

df.sum(axis='rows')

one    9.25
two   -5.80
dtype: float64

In [67]:
# 행방향 합계 구하기
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [68]:
df.loc['b'].sum()
# (= df.iloc[1].sum()) , (= df['one'].sum() )

2.5999999999999996

In [69]:
# 열방향으로 평균구하기
df.mean(axis='rows')

one    3.083333
two   -2.900000
dtype: float64

In [70]:
# 열방향으로 분산구하기
df.var(axis='rows')

one    12.205833
two     5.120000
dtype: float64

In [71]:
# 행방향으로 평균구하기
df.mean(axis='columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [72]:
df.mean(axis='columns',skipna=False) # NaN이 있으면 계산 안하고 NaN 출력

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

one의 NaN은 남은 값들의 평균으로 대체. two의 NaN은 가장 작은 값으로 대체

In [73]:
# 평균값 구하기

one_mean = df.mean(axis=0)['one']
one_mean

3.0833333333333335

In [74]:
# 최소값 구하기

two_min = df.min(axis=0)['two']
two_min

-4.5

In [75]:
df['one'] = df['one'].fillna(value=one_mean)
df['two'] = df['two'].fillna(value=two_min)
df

        one  two
a  1.400000 -4.5
b  7.100000 -4.5
c  3.083333 -4.5
d  0.750000 -1.3

---
# DataFrame Merging(병합)

In [76]:
df1 = pd.DataFrame({'key':list("bbacaab"),'data1':range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [77]:
df2 = pd.DataFrame({'key':list('abd'),'data2':range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [79]:
# 병합하기
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

> key c와 d는 서로 match되지 않으므로 출력되지않음

In [80]:
# 모두 보이기
pd.merge(df1,df2,on='key',how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [81]:
# df1 기준으로 합치기
pd.merge(df1,df2,on='key',how='left')

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0
5   a      5    0.0
6   b      6    1.0

In [82]:
# df2 기준으로 합치기 
pd.merge(df1,df2,on='key',how='right')

  key  data1  data2
0   a    2.0      0
1   a    4.0      0
2   a    5.0      0
3   b    0.0      1
4   b    1.0      1
5   b    6.0      1
6   d    NaN      2

### 두개의 dataframe에 중복된 값이 있는 경우

In [83]:
df1 = pd.DataFrame({'key':list('bbacab'),'data1':range(6)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [84]:
df2 = pd.DataFrame({'key':list('ababd'),'data2':range(5)})
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [86]:
pd.merge(df1,df2,on='key',how='inner') # how = inner (default)

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

### key name이 다를 경우

In [90]:
df1 = pd.DataFrame({'lkey':list('bbacab'),'data1':range(6)})
df2 = pd.DataFrame({'rkey':list('ababd'),'data2':range(5)})

In [91]:
pd.merge(df1,df2,left_on="lkey",right_on="rkey",how='inner')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      0    b      3
2    b      1    b      1
3    b      1    b      3
4    b      5    b      1
5    b      5    b      3
6    a      2    a      0
7    a      2    a      2
8    a      4    a      0
9    a      4    a      2

### 하나의 key값으로 병합하는 경우

In [92]:
df1 = pd.DataFrame({'key':list('bbacab'),'data1':range(6)})
df2 = pd.DataFrame({'group_val':[3.5,7]},index=['a','b'])
df2

   group_val
a        3.5
b        7.0

In [93]:
pd.merge(df1,df2,left_on="key",right_index=True)

  key  data1  group_val
0   b      0        7.0
1   b      1        7.0
5   b      5        7.0
2   a      2        3.5
4   a      4        3.5

---
### Data Concatenating(연결)

In [94]:
s1 = pd.Series([0,1],index=['a','b'])
s1

a    0
b    1
dtype: int64

In [95]:
s2 = pd.Series([2,3,4],index=['c','d','e'])
s2

c    2
d    3
e    4
dtype: int64

In [96]:
s3 = pd.Series([5,6],index=['f','g'])
s3

f    5
g    6
dtype: int64

In [97]:
# s1, s2, s3 합치기
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [98]:
# Series를 합치면서 dataFrame만들기

pd.concat([s1,s2,s3],axis=1,sort=True)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [99]:
# column에 이름 넣기
pd.concat([s1,s2,s3],axis=1,sort=True,keys=['s1','s2','s3'])

    s1   s2   s3
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

----
### DataFrame의 Concatenation

In [104]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2),index=['a','b','c'],columns=['one','two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [109]:
df2 = pd.DataFrame(5 +np.arange(4).reshape(2,2),index=['a','c'],columns=['three','four'])
df2

   three  four
a      5     6
c      7     8

In [110]:
# df1과 df2를 합치기
pd.concat([df1,df2],axis=1,sort=True)

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [111]:
# index 새로 만들기 
pd.concat([df1,df2],axis=1,sort=True,ignore_index=True)

   0  1    2    3
a  0  1  5.0  6.0
b  2  3  NaN  NaN
c  4  5  7.0  8.0

In [113]:
# df1과 df2를 합치기
pd.concat([df1,df2],axis=0,sort=True,ignore_index=True)

   four  one  three  two
0   NaN  0.0    NaN  1.0
1   NaN  2.0    NaN  3.0
2   NaN  4.0    NaN  5.0
3   6.0  NaN    5.0  NaN
4   8.0  NaN    7.0  NaN

---
### 데이터프레임 중복값 제거

In [114]:
df = pd.DataFrame({'k1':['one']*3 + ['two']*4,'k2':[1,1,2,3,3,4,4]})
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [115]:
# 중복값 확인
df.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [116]:
# 중복값 제거
df.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [117]:
# 새로운 열 추가

df['v1'] = np.arange(7)
df

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [119]:
df.drop_duplicates()

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [120]:
df['k1'].drop_duplicates()

0    one
3    two
Name: k1, dtype: object

In [121]:
# k1의 값들로 중복값 제거
df.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [122]:
# k1의 값드로 마지막 값으로 추력
df.drop_duplicates(['k1'],keep='last')

    k1  k2  v1
2  one   2   2
6  two   4   6

### Category 사용하기

In [123]:
df3 = pd.DataFrame({'id':[1,2,3,4,5,6],
                    'raw_grade':['a','b','b','a','a','e']
})
df3

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [124]:
# category 자료형으로 변환하기 
df3['grade'] = df3['raw_grade'].astype('category')
df3

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [125]:
df3['raw_grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: raw_grade, dtype: object

In [126]:
df3['grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [127]:
# category를 이용하여 자료 변형
df3['grade'].cat.categories = ['very good','good','very bad']
df3

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [128]:
df3.sort_values(by='grade')

   id raw_grade      grade
0   1         a  very good
3   4         a  very good
4   5         a  very good
1   2         b       good
2   3         b       good
5   6         e   very bad

In [129]:
df3['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): ['very good', 'good', 'very bad']

### 데이터의 범위 정하기

In [130]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
bins=[18,25,35,60,100]

In [131]:
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [132]:
# 범주 관련 code보기
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [133]:
# 범주 관련 빈도수 보기
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [134]:
# category 이름 정하기
group_names = ['Youth','YoungAdult','ModdleAged','Senior']
cat2 = pd.cut(ages,bins,labels=group_names)
cat2.value_counts()

Youth         5
YoungAdult    3
ModdleAged    3
Senior        1
dtype: int64